Documents/ОбеспечениеРесурсами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОбеспечениеРесурсами</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаРесурсы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаявкиНаРесурсы</xr:Item>
				<xr:Item>AccumulationRegister.ЗаявкиНаРесурсыДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегическиеЦели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Персонал</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСтавок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Деньги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗаявкиНаРесурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаявкиНаРесурсы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявкиНаРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегическиеЦели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаявкиНаРесурсыДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаявкиНаРесурсыДС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявкиНаРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегическиеЦели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ОбеспечениеРесурсами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ЗаполнитьПоОстаткам(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаРесурсыОстатки.Ресурс КАК Ресурс,
	               |	ЗаявкиНаРесурсыОстатки.КоличествоОстаток КАК Количество,
	               |	ЗаявкиНаРесурсыОстатки.КоличествоСтавокОстаток КАК КоличествоСтавок,
	               |	ЗаявкиНаРесурсыОстатки.КоличествоЧасовОстаток КАК КоличествоЧасов,
	               |	ВЫБОР
	               |		КОГДА ЗаявкиНаРесурсыОстатки.Ресурс ССЫЛКА Справочник.Материалы
	               |			ТОГДА 1
	               |		КОГДА ЗаявкиНаРесурсыОстатки.Ресурс ССЫЛКА Справочник.Инструменты
	               |			ТОГДА 2
	               |		КОГДА ЗаявкиНаРесурсыОстатки.Ресурс ССЫЛКА Справочник.Должности
	               |			ТОГДА 0
	               |	КОНЕЦ КАК ВидРесурса,
	               |	НЕОПРЕДЕЛЕНО КАК Контрагент,
	               |	НЕОПРЕДЕЛЕНО КАК Договор,
	               |	0 КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЗаявкиНаРесурсы.Остатки(
	               |			&Период,
	               |			Договор = &Договор
	               |				И Задача = &Задача
	               |				И Проект = &Проект) КАК ЗаявкиНаРесурсыОстатки
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""ДС"",
	               |	0,
	               |	0,
	               |	0,
	               |	4,
	               |	ЗаявкиНаРесурсыДСОстатки.КонтрагентЗаявки,
	               |	ЗаявкиНаРесурсыДСОстатки.ДоговорЗаявки,
	               |	ЗаявкиНаРесурсыДСОстатки.СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ЗаявкиНаРесурсыДС.Остатки(
	               |			&Период,
	               |			Договор = &Договор
	               |				И Задача = &Задача
	               |				И Проект = &Проект) КАК ЗаявкиНаРесурсыДСОстатки";	
	Запрос.УстановитьПараметр("Договор", Объект.Договор);
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	Запрос.УстановитьПараметр("Задача", Объект.Задача);
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));
	
	ВыборкаРесурсы = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРесурсы.Следующий() Цикл
		Если ВыборкаРесурсы.ВидРесурса = 0 Тогда
			СтрокаТаблицы = Объект.Персонал.Добавить();
			СтрокаТаблицы.Должность = ВыборкаРесурсы.Ресурс;
		ИначеЕсли ВыборкаРесурсы.ВидРесурса = 1 Тогда
			СтрокаТаблицы = Объект.Материалы.Добавить();
			СтрокаТаблицы.Материал = ВыборкаРесурсы.Ресурс;
		ИначеЕсли ВыборкаРесурсы.ВидРесурса = 2 Тогда
			СтрокаТаблицы = Объект.Инструменты.Добавить();
			СтрокаТаблицы.Инструмент = ВыборкаРесурсы.Ресурс;
		ИначеЕсли ВыборкаРесурсы.ВидРесурса = 4 Тогда
			СтрокаТаблицы = Объект.Деньги.Добавить();   
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаРесурсы);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоОснованию(Объект, ДанныеЗаполнения) Экспорт
	
	Объект.Проект = ДанныеЗаполнения.Проект;
	Объект.Договор = ДанныеЗаполнения.Договор;
	Объект.Задача = ДанныеЗаполнения.Задача;
	Объект.ДокументОснование = ДанныеЗаполнения;
	ЗаполнитьПоОстаткам(Объект);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//// Перемещение товаров
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПФ_ЗаявкаНаРесурсы";
	//КомандаПечати.Представление = НСтр("ru = 'Заявка на ресурсы'");
	//
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// Печать накладной на перемещение.
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_ЗаявкаНаРесурсы");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_ЗаявкаНаРесурсы",
			НСтр("ru = 'Заявка на ресурсы'"),
			ПечатнаяФормаДоговора(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ЗаявкаНаРесурсы.ПФ_ЗаявкаНаРесурсы");
	КонецЕсли;
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#Область СлужебныеПроцедурыИФункции

Функция ПечатнаяФормаДоговора(МассивОбъектов, ОбъектыПечати)
	
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	ЗаявкаНаРесурсы.Ссылка КАК Ссылка,
	//|	ЗаявкаНаРесурсы.Номер КАК Номер,
	//|	ЗаявкаНаРесурсы.Дата КАК Дата,
	//|	ЗаявкаНаРесурсы.Договор.Представление КАК Договор,
	//|	ЗаявкаНаРесурсы.Задача КАК Задача,
	//|	ЗаявкаНаРесурсы.Задача.Наименование КАК ЗадачаНаименование,
	//|	ЗаявкаНаРесурсы.Задача.Администратор КАК ЗадачаАдминистратор,
	//|	ЗаявкаНаРесурсы.Задача.ДатаНачала КАК ЗадачаДатаНачала,
	//|	ЗаявкаНаРесурсы.Задача.ДатаОкончания КАК ЗадачаДатаОкончания,
	//|	ЗаявкаНаРесурсы.Задача.СтатусЗадачи КАК ЗадачаСтатусЗадачи,
	//|	ЗаявкаНаРесурсы.Проект.Наименование КАК ПроектНаименование,
	//|	ЗаявкаНаРесурсы.Проект.ДатаНачала КАК ПроектДатаНачала,
	//|	ЗаявкаНаРесурсы.Проект.ДатаОкончания КАК ПроектДатаОкончания,
	//|	ЗаявкаНаРесурсы.Проект.Администратор КАК ПроектАдминистратор,
	//|	ЗаявкаНаРесурсы.АдминистраторДоговора КАК АдминистраторДоговора,
	//|	ЗаявкаНаРесурсы.Персонал.(
	//|		Ссылка КАК Ссылка,
	//|		НомерСтроки КАК НомерСтроки,
	//|		Должность КАК Должность,
	//|		КоличествоСтавок КАК КоличествоСтавок,
	//|		КоличествоЧасов КАК КоличествоЧасов
	//|	) КАК Персонал,
	//|	ЗаявкаНаРесурсы.Деньги.(
	//|		Ссылка КАК Ссылка,
	//|		НомерСтроки КАК НомерСтроки,
	//|		Контрагент КАК Контрагент,
	//|		Договор КАК Договор,
	//|		Сумма КАК Сумма
	//|	) КАК Деньги,
	//|	ЗаявкаНаРесурсы.Материалы.(
	//|		Ссылка КАК Ссылка,
	//|		НомерСтроки КАК НомерСтроки,
	//|		Материал КАК Материал,
	//|		Количество КАК Количество
	//|	) КАК Материалы,
	//|	ЗаявкаНаРесурсы.Инструменты.(
	//|		Ссылка КАК Ссылка,
	//|		НомерСтроки КАК НомерСтроки,
	//|		Инструмент КАК Инструмент,
	//|		КоличествоЧасов КАК КоличествоЧасов
	//|	) КАК Инструменты,
	//|	ЗаявкаНаРесурсы.Согласующие.(
	//|		Ссылка КАК Ссылка,
	//|		НомерСтроки КАК НомерСтроки,
	//|		Сотрудник КАК Сотрудник
	//|	) КАК Согласующие
	//|ИЗ
	//|	Документ.ЗаявкаНаРесурсы КАК ЗаявкаНаРесурсы
	//|ГДЕ
	//|	ЗаявкаНаРесурсы.Ссылка В(&Ссылка)";
	//
	//Запрос = Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	//
	//Пакет = Запрос.Выполнить();
	//
	//Шапка = Пакет.Выбрать();
	//
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.КлючПараметровПечати = "ПФ_ЗаявкаНаРесурсы";
	//
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявкаНаРесурсы.ПФ_ЗаявкаНаРесурсы");
	//
	//Пока Шапка.Следующий() Цикл
	//	Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
	//		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	
	//	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	//	
	//	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	//	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	//	
	//	ОбластьЗаголовок.Параметры.НомерДокумента = Шапка.Номер;
	//	ОбластьЗаголовок.Параметры.ДатаДокумента = Формат(Шапка.Дата, "ДФ=dd.MM.yyyy");
	//	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	//	
	//	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, Шапка);
	//	ОбластьШапка.Параметры.ЗадачаДатаНачала = Формат(ОбластьШапка.Параметры.ЗадачаДатаНачала, "ДФ=dd.MM.yyyy");
	//	ОбластьШапка.Параметры.ЗадачаДатаОкончания = Формат(ОбластьШапка.Параметры.ЗадачаДатаОкончания, "ДФ=dd.MM.yyyy");
	//	ОбластьШапка.Параметры.ПроектДатаНачала = Формат(ОбластьШапка.Параметры.ПроектДатаНачала, "ДФ=dd.MM.yyyy");
	//	ОбластьШапка.Параметры.ПроектДатаОкончания = Формат(ОбластьШапка.Параметры.ПроектДатаОкончания, "ДФ=dd.MM.yyyy");
	//	ТабличныйДокумент.Вывести(ОбластьШапка);
	//	
	//	//ТЗРесурсы = Шапка.Ресурсы.Выгрузить();
	//	//Для Каждого Строка из ТЗРесурсы Цикл
	//	//	ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
	//	//	ТабличныйДокумент.Вывести(ОбластьСтрока);
	//	//КонецЦикла;
	//	
	//	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы3");
	//	ТабличныйДокумент.Вывести(ОбластьШапка);
	//	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы3");
	//	Строка = Шапка.Персонал.Выбрать();
	//	Пока Строка.Следующий() Цикл
	//		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
	//		ТабличныйДокумент.Вывести(ОбластьСтрока);
	//	КонецЦикла;
	//	
	//	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы2");
	//	ТабличныйДокумент.Вывести(ОбластьШапка);
	//	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы2");
	//	Строка = Шапка.Деньги.Выбрать();
	//	Пока Строка.Следующий() Цикл
	//		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
	//		ТабличныйДокумент.Вывести(ОбластьСтрока);
	//	КонецЦикла;
	//	
	//	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы1");
	//	ТабличныйДокумент.Вывести(ОбластьШапка);
	//	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы1");
	//	Строка = Шапка.Инструменты.Выбрать();
	//	Пока Строка.Следующий() Цикл
	//		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
	//		ТабличныйДокумент.Вывести(ОбластьСтрока);
	//	КонецЦикла;
	//	
	//	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	//	ТабличныйДокумент.Вывести(ОбластьШапка);
	//	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
	//	Строка = Шапка.Материалы.Выбрать();
	//	Пока Строка.Следующий() Цикл
	//		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
	//		ТабличныйДокумент.Вывести(ОбластьСтрока);
	//	КонецЦикла;
	//	
	//	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	//
	//КонецЦикла;
	//
	//Возврат ТабличныйДокумент;
	//
	
КонецФункции

#КонецОбласти
#КонецЕсли
